test-plan/postings/Postings.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Postings" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="base_url" elementType="Argument">
            <stringProp name="Argument.name">base_url</stringProp>
            <stringProp name="Argument.value">postingsservice-uat.inkuda.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="client_id" elementType="Argument">
            <stringProp name="Argument.name">client_id</stringProp>
            <stringProp name="Argument.value">017C54DA-55FC-447A-A54B-3E942550E915</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AccountNumber1" elementType="Argument">
            <stringProp name="Argument.name">AccountNumber1</stringProp>
            <stringProp name="Argument.value">1100906814</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="AccountNumber2" elementType="Argument">
            <stringProp name="Argument.name">AccountNumber2</stringProp>
            <stringProp name="Argument.value">1100014937</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="client_id" elementType="Argument">
            <stringProp name="Argument.name">client_id</stringProp>
            <stringProp name="Argument.value">017C54DA-55FC-447A-A54B-3E942550E915</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">clientId</stringProp>
            <stringProp name="Header.value">${client_id}</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stopthread</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">300</stringProp>
        <stringProp name="ThreadGroup.delay">5</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Post" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;PostingEntryViewModel&quot;: [{&#xd;
			&quot;Amount&quot;: 100.00,&#xd;
			&quot;PostingRecordType&quot;: 1,&#xd;
			&quot;AccountNumber&quot;: &quot;${AccountNumber1}&quot;,&#xd;
			&quot;Narration&quot;: &quot;Guze&quot;,&#xd;
			&quot;InstrumentNumber&quot;: &quot;${__Random(000000000,999999999)}T123hKUD&quot;,&#xd;
			&quot;EntryCode&quot;: &quot;D305&quot;,&#xd;
			&quot;Depositor&quot;: &quot;Guze&quot;,&#xd;
			&quot;BranchID&quot;: &quot;18f1d9ec-8be8-47d3-b736-80fb721fced6&quot;&#xd;
		},&#xd;
&#xd;
&#xd;
		{&#xd;
			&quot;Amount&quot;: 100.00,&#xd;
			&quot;PostingRecordType&quot;: 2,&#xd;
			&quot;AccountNumber&quot;: &quot;${AccountNumber2}&quot;,&#xd;
			&quot;Narration&quot;: &quot;Guze&quot;,&#xd;
			&quot;InstrumentNumber&quot;: &quot;${__Random(000000000,999999999)}T123hKUD&quot;,&#xd;
			&quot;EntryCode&quot;: &quot;C305&quot;,&#xd;
			&quot;Depositor&quot;: &quot;Guze&quot;,&#xd;
			&quot;BranchID&quot;: &quot;18f1d9ec-8be8-47d3-b736-80fb721fced6&quot;&#xd;
		}&#xd;
&#xd;
	],&#xd;
	&quot;PostingBaseViewModel&quot;: {&#xd;
		&quot;HasCOTWaiver&quot;: false,&#xd;
		&quot;ForceDebit&quot;: false,&#xd;
		&quot;RealDate&quot;: &quot;2020-11-02T07:44:49.1470824Z&quot;,&#xd;
		&quot;FinancialDate&quot;: &quot;2017-02-13T00:00:00&quot;,&#xd;
		&quot;IPAddress&quot;: &quot;172.31.23.118&quot;,&#xd;
&#xd;
		&quot;PostingType&quot;: 1&#xd;
	}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${base_url}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">api/v1/Posting/Post</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Reversal" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;realDate&quot;: &quot;1998-11-12T10:02:11.870Z&quot;,&#xd;
    &quot;referenceNumber&quot;: &quot;quis in&quot;,&#xd;
    &quot;instrumentNumber&quot;: &quot;culpa Ut&quot;,&#xd;
    &quot;userID&quot;: &quot;77fa40cc-8c05-9e61-9d6a-287331005df6&quot;,&#xd;
    &quot;ipAddress&quot;: &quot;nisi amet&quot;,&#xd;
    &quot;forceDebit&quot;: false&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${base_url}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">api/v1/ReversalPosting/PostReversal</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Savings" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;PostingEntryViewModel&quot;: [{&#xd;
			&quot;Amount&quot;: 100.00,&#xd;
			&quot;PostingRecordType&quot;: 1,&#xd;
			&quot;AccountNumber&quot;: &quot;${AccountNumber1}&quot;,&#xd;
			&quot;Narration&quot;: &quot;Guze&quot;,&#xd;
			&quot;InstrumentNumber&quot;: &quot;${__Random(000000000,999999999)}T123hKUD&quot;,&#xd;
			&quot;EntryCode&quot;: &quot;D305&quot;,&#xd;
			&quot;Depositor&quot;: &quot;Guze&quot;,&#xd;
			&quot;BranchID&quot;: &quot;18f1d9ec-8be8-47d3-b736-80fb721fced6&quot;&#xd;
		},&#xd;
&#xd;
&#xd;
		{&#xd;
			&quot;Amount&quot;: 100.00,&#xd;
			&quot;PostingRecordType&quot;: 2,&#xd;
			&quot;AccountNumber&quot;: &quot;${AccountNumber2}&quot;,&#xd;
			&quot;Narration&quot;: &quot;Guze&quot;,&#xd;
			&quot;InstrumentNumber&quot;: &quot;${__Random(000000000,999999999)}T123hKUD&quot;,&#xd;
			&quot;EntryCode&quot;: &quot;C305&quot;,&#xd;
			&quot;Depositor&quot;: &quot;Guze&quot;,&#xd;
			&quot;BranchID&quot;: &quot;18f1d9ec-8be8-47d3-b736-80fb721fced6&quot;&#xd;
		}&#xd;
&#xd;
	],&#xd;
	&quot;PostingBaseViewModel&quot;: {&#xd;
		&quot;HasCOTWaiver&quot;: false,&#xd;
		&quot;ForceDebit&quot;: false,&#xd;
		&quot;RealDate&quot;: &quot;2020-11-02T07:44:49.1470824Z&quot;,&#xd;
		&quot;FinancialDate&quot;: &quot;2017-02-13T00:00:00&quot;,&#xd;
		&quot;IPAddress&quot;: &quot;172.31.23.118&quot;,&#xd;
&#xd;
		&quot;PostingType&quot;: 1&#xd;
	}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${base_url}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">api/v1/Posting/Post</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="Backend Listener" enabled="true">
        <elementProp name="arguments" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="influxdbMetricsSender" elementType="Argument">
              <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
              <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.HttpMetricsSender</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="influxdbUrl" elementType="Argument">
              <stringProp name="Argument.name">influxdbUrl</stringProp>
              <stringProp name="Argument.value">http://jmeter-influxdb:8086/write?db=jmeter</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="application" elementType="Argument">
              <stringProp name="Argument.name">application</stringProp>
              <stringProp name="Argument.value">kuda_postings</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="measurement" elementType="Argument">
              <stringProp name="Argument.name">measurement</stringProp>
              <stringProp name="Argument.value">jmeter</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="summaryOnly" elementType="Argument">
              <stringProp name="Argument.name">summaryOnly</stringProp>
              <stringProp name="Argument.value">false</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="samplersRegex" elementType="Argument">
              <stringProp name="Argument.name">samplersRegex</stringProp>
              <stringProp name="Argument.value">.*</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="percentiles" elementType="Argument">
              <stringProp name="Argument.name">percentiles</stringProp>
              <stringProp name="Argument.value">90;95;99</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="testTitle" elementType="Argument">
              <stringProp name="Argument.name">testTitle</stringProp>
              <stringProp name="Argument.value">Test name</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
            <elementProp name="eventTags" elementType="Argument">
              <stringProp name="Argument.name">eventTags</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="classname">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbBackendListenerClient</stringProp>
      </BackendListener>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>